SamHuang-samuel1008/11th_hw/MovieApp_Authentication/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title LIKE '%%' OR description LIKE '%%' OR year_released LIKE '%%')
---
    def load_movie
      @movie = Movie.find params[:id]