SamHuang-samuel1008/8th_hw/MovieApp/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title LIKE '%%' OR description LIKE '%%' OR year_released LIKE '%%')
---
  def load_movie
    @movie = Movie.find(params[:id])